Repository: giellalt/corpus-fin
Catalog: tmx/sme/admin/sd/www.samediggi.fi/index2.php_option=com_content_task=view_id=302_lang=finnish.html.tmx
Source language: fin
Languages: sme

source: Yhteystiedot
sme: Oktavuohta

source: Kokous- ja tapahtumapalvelut
sme: Čoahkkin- ja dáhpáhusbálvalusat

source: Saamelaiskulttuurikeskus Sajos
sme: Sámekulturguovddáš Sajos

source: http://www.sajos.fi /
sme: 99870 Anár / Inari

source: Tilavaraukset ja markkinointi
sme: Várremat ja márkanastin

source: Toimitilahuolto / Vahtimestari
sme: Doaibmalatnjafuolahus / Fáktameašttir

source: Ravintola Lyeme
sme: Vuovdinrehkegat
